{"config": {"layers": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 128, "dtype": "float32", "batch_input_shape": [null, 1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"rate": 0.2, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 64, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"rate": 0.25, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 32, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 3, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_4", "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}